Documents/бит_КорректировкаПоказанийСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_КорректировкаПоказанийСчетчиков</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_ПоказанияСчетчиков</xr:Item>
				<xr:Item>InformationRegister.бит_СведенияОКорректировкеНачальныхПоказаний</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидОперацииКорректировкиПоказанийСчетчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказанияНаселения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КорректировкаПоказаний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтПоказаний</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникПоказаний</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ИсточникПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорректировочныеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Многотарифный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальныеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачисленияЗаПериод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоследниеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счетчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачисленияЗаПериод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоследниеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счетчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_СчетчикиНаУслугахОбщий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СчетчикиНаУслугахОбщий</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСчетчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипСчетчика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРаспределения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Многотарифный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоУстановкиСчетчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Комнаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Comment>Приоритет общедомового счетчика</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьСтавкуПоСчетчику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетчикСЗависимымиУслугами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнаяУслуга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПравилоУменьшения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаУменьшения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРаспределенияУменьшения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРаспределения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/бит_ПоказанияСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_ПоказанияСчетчиков</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоследниеПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущиеПоказанияИнспектора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущиеПоказанияНаселения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказанияПодкрутка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/бит_СведенияПоУслугамЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияПоУслугамЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЕдиницПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_ВидОперацииКорректировкиПоказанийСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидОперацииКорректировкиПоказанийСчетчиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КорректировкаОшибочныхПоказаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаНачальныхПоказаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаПодкрутки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_КорректировкаПоказанийСчетчиков/Forms/ФормаДокументаУправляемая/Ext/Form/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте 
Перем мКэшРеквизитовФормы;       // Хранит текущие значения реквизитов формы. Клиент.

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Функция получает тип объекта.
//
// Параметры:
//  ОбъектСсылка - ДокументСсылка.
//
// Возвращаемое значение:
//  ТипОбъекта - Тип.
// 
&НаСервереБезКонтекста 
Функция ПолучитьТипОбъекта(ОбъектСсылка)
	
	ИмяОбъекта = ОбъектСсылка.Метаданные().Имя;
	ТипОбъекта = Тип("ДокументОбъект." + ИмяОбъекта);
	
	Возврат ТипОбъекта;
	
КонецФункции // ПолучитьТипОбъекта()

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФорм

// Процедура устнавливает заголовок формы документа.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура УстановитьЗаголовокФормыДокумента()
	
	СтруктураЗаголовка = Новый Структура;
	СтруктураЗаголовка.Вставить("ПредставлениеОбъекта", мКэшЗначений.ПредставлениеОбъекта);
	СтруктураЗаголовка.Вставить("СтрокаВидаОперации"  , Строка(""));
	СтруктураЗаголовка.Вставить("ЭтоНовый"			  , Параметры.Ключ.Пустая());
	СтруктураЗаголовка.Вставить("ДокументПроведен"	  , Объект.Проведен);
	
	бит_РаботаСДиалогамиКлиент.УстановитьЗаголовокФормыДокумента(ЭтаФорма
	,СтруктураЗаголовка);
	
КонецПроцедуры

// Процедура осуществляет управление доступностью/видимостью элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере 
Процедура УправлениеЭлементамиФормы()
	
	Если Объект.ВидОперации = Перечисления.бит_ВидОперацииКорректировкиПоказанийСчетчиков.КорректировкаОшибочныхПоказаний Тогда
		
		Элементы.Группа3.Видимость                                  = Ложь;
		Элементы.КорректировкаПоказанийЗаполнить.Доступность        = Истина;
		Элементы.КорректировкаПоказанийЗаполнить.Заголовок        	= "Рассчитать";
		Элементы.КорректировкаПоказанийЛицевойСчет.Доступность      = Истина;
		Элементы.КорректировкаПоказанийСчетчик.Доступность          = Истина;
		Элементы.КорректировкаПоказанийПериод.Доступность           = Истина;		
		Элементы.КорректировкаПоказанийНачисленияЗаПериод.Видимость = Истина;
		
	ИначеЕсли Объект.ВидОперации = Перечисления.бит_ВидОперацииКорректировкиПоказанийСчетчиков.КорректировкаПодкрутки Тогда
		
		Элементы.Группа3.Видимость                                  = Истина;
		Элементы.КорректировкаПоказанийЗаполнить.Доступность        = Истина;		
		Элементы.КорректировкаПоказанийЗаполнить.Заголовок        	= "Заполнить";
		Элементы.КорректировкаПоказанийЛицевойСчет.Доступность      = Ложь;
		Элементы.КорректировкаПоказанийСчетчик.Доступность          = Ложь;
		Элементы.КорректировкаПоказанийПериод.Доступность           = Ложь;		
		Элементы.КорректировкаПоказанийНачисленияЗаПериод.Видимость = Истина;
		
	ИначеЕсли Объект.ВидОперации = Перечисления.бит_ВидОперацииКорректировкиПоказанийСчетчиков.КорректировкаНачальныхПоказаний Тогда
		
		Элементы.Группа3.Видимость                                  = Ложь;
		Элементы.КорректировкаПоказанийЗаполнить.Доступность        = Ложь;		
		Элементы.КорректировкаПоказанийЗаполнить.Заголовок        	= "Заполнить";
		Элементы.КорректировкаПоказанийЛицевойСчет.Доступность      = Истина;
		Элементы.КорректировкаПоказанийСчетчик.Доступность          = Истина;
		Элементы.КорректировкаПоказанийПериод.Доступность           = Истина;		
		Элементы.КорректировкаПоказанийНачисленияЗаПериод.Видимость = Ложь;
		
	КонецЕсли; 
	
	ЕстьРазовые = ?(Элементы.ВводРазовых.Заголовок = "Ввести разовые начисления.", Ложь, Истина);
	
	Элементы.КорректировкаПоказаний.ТолькоПросмотр = ЕстьРазовые;
	Элементы.Организация.ТолькоПросмотр            = ЕстьРазовые;
	Элементы.Дата.ТолькоПросмотр                   = ЕстьРазовые;
	Элементы.Номер.ТолькоПросмотр                  = ЕстьРазовые;
	Элементы.Улица.ТолькоПросмотр                  = ЕстьРазовые;
	Элементы.Здание.ТолькоПросмотр                 = ЕстьРазовые;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	Если Параметры.Свойство("ЗаполнитьИзСправочникаЛицевыеСчета") Тогда
		
		Объект.ВидОперации   = Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.ВидОперации;
		Объект.Дата          = Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.Дата;
		Объект.Организация   = Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.Организация;		
		Объект.Здание        = Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.Здание;
		Объект.Улица         = Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.Улица;		
		Объект.Ответственный = Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.Ответственный;
		
		Элементы.Организация.ТолькоПросмотр   = Истина;
		Элементы.Ответственный.ТолькоПросмотр = Истина;
		
		НоваяСтрока = Объект.КорректировкаПоказаний.Добавить();
		
		НоваяСтрока.ЛицевойСчет       = Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.ЛицевойСчет;
		НоваяСтрока.Счетчик           = Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.Счетчик;
		НоваяСтрока.Многотарифный     = Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.Многотарифный;
		НоваяСтрока.ИсточникПоказаний = Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.ИсточникПоказаний;
		
		Если НоваяСтрока.Многотарифный Тогда
			
			НоваяСтрока.Услуга = Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.Услуга;
			
			СтрокаУслуг = Объект.ТаблицаУслуг.Добавить();
			
			СтрокаУслуг.ЛицевойСчет = Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.ЛицевойСчет;
			СтрокаУслуг.Услуга      = Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.Услуга;
			
		Иначе
			
			ЗаполнитьТаблицуУслуг(НоваяСтрока.ЛицевойСчет, НоваяСтрока.Счетчик, КонецДня(Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.Дата));
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПолучитьРзовые();
	
	// Установить видимость реквизитов и заголовков колонок.	
	УправлениеЭлементамиФормы();
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	бит_рлс_ОбщегоНазначения.ПроверитьБитыеСсылкиВОбъекте(ДокументОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение
		И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидОперацииКорректировкиПоказанийСчетчиков.КорректировкаПодкрутки") Тогда
		
		ЕстьПустыеСтроки = ПроверитьПустыеСтроки();
		
		Если ЕстьПустыеСтроки Тогда
			
			Отказ = Истина;
			
			Ответ = Неопределено;
			
			ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗаписьюЗавершение", ЭтотОбъект), "Удалить не измененные строки с корректировкой показаний равной нулю?", РежимДиалогаВопрос.ДаНетОтмена); 
			
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
    
    Если Ответ = КодВозвратаДиалога.Да Тогда
        
        УдалитьПустыеСтроки();
		
		ЗаписатьНаСервере();
		
    ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда 
        
		ЗаписатьНаСервере();
        
    КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.бит_КорректировкаПоказанийСчетчиков"));
	
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не удалось записать" + ОписаниеОшибки();
		Сообщение.Сообщить();
		
	КонецПопытки;
	
	ЗначениеВДанныеФормы(ДокументОбъект,Объект);
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.ВидОперации = Перечисления.бит_ВидОперацииКорректировкиПоказанийСчетчиков.КорректировкаОшибочныхПоказаний
		И НуженПерерасчет Тогда
		ЗаполнитьОшибочныеПоказанияНаСервере();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьЗаголовокФормыДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФорм

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЭтаФорма.мМассивСтрок.Очистить();
	Если НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидОперацииКорректировкиПоказанийСчетчиков.КорректировкаОшибочныхПоказаний") Тогда
		Объект.ТаблицаУслуг.Очистить();
		Объект.КорректировкаПоказаний.Очистить();
		ЗаполнитьНаСервере();
		НуженПерерасчет = Истина;
	Иначе
		ЗаполнитьОшибочныеПоказанияНаСервере();
		НуженПерерасчет = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьОшибочныеПоказанияНаСервере()
	
	Объект.ТаблицаУслуг.Очистить();
	ТЗКорректировкаПоказаний = Объект.КорректировкаПоказаний.Выгрузить();
	ТЗНеМноготарифные = ТЗКорректировкаПоказаний.Скопировать(Новый Структура("Многотарифный", Ложь),"ЛицевойСчет, Счетчик");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"				, КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Ссылка"				, Объект.Ссылка);
	Запрос.УстановитьПараметр("ТЗНеМноготарифные"	, ТЗНеМноготарифные);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЗНеМноготарифные.ЛицевойСчет КАК ЛицевойСчет,
	|	ТЗНеМноготарифные.Счетчик КАК Счетчик
	|ПОМЕСТИТЬ ВТ_ВсеСчетчики
	|ИЗ
	|	&ТЗНеМноготарифные КАК ТЗНеМноготарифные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект КАК ЛицевойСчет,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга
	|ПОМЕСТИТЬ ВТ_ВсеУслуги
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
	|			&Дата,
	|			(ВЫРАЗИТЬ(Объект КАК Справочник.бит_ЛицевыеСчета), Счетчик) В
	|				(ВЫБРАТЬ
	|					ВТ_ВсеСчетчики.ЛицевойСчет,
	|					ВТ_ВсеСчетчики.Счетчик
	|				ИЗ
	|					ВТ_ВсеСчетчики)) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ПоказанияСчетчиков.Период КАК Период,
	|	бит_ПоказанияСчетчиков.Объект КАК ЛицевойСчет,
	|	бит_ПоказанияСчетчиков.Счетчик КАК Счетчик,
	|	бит_ПоказанияСчетчиков.Услуга КАК Услуга,
	|	бит_ПоказанияСчетчиков.ПоследниеПоказания КАК ПоследниеПоказания
	|ПОМЕСТИТЬ ВТ_Показания
	|ИЗ
	|	РегистрНакопления.бит_ПоказанияСчетчиков КАК бит_ПоказанияСчетчиков
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВсеУслуги КАК ВТ_ВсеУслуги
	|		ПО ((ВЫРАЗИТЬ(бит_ПоказанияСчетчиков.Объект КАК Справочник.бит_ЛицевыеСчета)) = ВТ_ВсеУслуги.ЛицевойСчет)
	|			И бит_ПоказанияСчетчиков.Счетчик = ВТ_ВсеУслуги.Счетчик
	|			И бит_ПоказанияСчетчиков.Услуга = ВТ_ВсеУслуги.Услуга
	|			И (бит_ПоказанияСчетчиков.Регистратор <> &Ссылка)
	|			И (бит_ПоказанияСчетчиков.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам)
	|			И (бит_ПоказанияСчетчиков.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	ЛицевойСчет,
	|	Счетчик,
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_Показания.Период) КАК Период,
	|	ВТ_Показания.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_Показания.Счетчик КАК Счетчик,
	|	ВТ_Показания.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_ПоследниеПоказания
	|ИЗ
	|	ВТ_Показания КАК ВТ_Показания
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Показания.ЛицевойСчет,
	|	ВТ_Показания.Счетчик,
	|	ВТ_Показания.Услуга
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	ЛицевойСчет,
	|	Счетчик,
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ПоследниеПоказания.Период КАК Период,
	|	ВТ_ПоследниеПоказания.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_ПоследниеПоказания.Счетчик КАК Счетчик,
	|	ВТ_ПоследниеПоказания.Услуга КАК Услуга,
	|	ВТ_Показания.ПоследниеПоказания КАК ПоследниеПоказания
	|ИЗ
	|	ВТ_ПоследниеПоказания КАК ВТ_ПоследниеПоказания
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Показания КАК ВТ_Показания
	|		ПО ВТ_ПоследниеПоказания.Период = ВТ_Показания.Период
	|			И ВТ_ПоследниеПоказания.ЛицевойСчет = ВТ_Показания.ЛицевойСчет
	|			И ВТ_ПоследниеПоказания.Услуга = ВТ_Показания.Услуга
	|			И ВТ_ПоследниеПоказания.Счетчик = ВТ_Показания.Счетчик";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.ТаблицаУслуг.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	Если НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидОперацииКорректировкиПоказанийСчетчиков.КорректировкаНачальныхПоказаний") Тогда
		Для Каждого Стр Из Объект.КорректировкаПоказаний Цикл
			КолМесяцев = ?(Стр.ТипДокумента = Строка(Тип("ДокументСсылка.бит_УстановкаСчетчика")),0,1);
			Стр.НачисленияЗаПериод = ПолучитьНачисления(Стр.ЛицевойСчет, Стр.Счетчик, ДобавитьМесяц(Стр.ДатаОтПоказаний, КолМесяцев), Объект.Дата, Стр.Услуга, Стр.Многотарифный);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВводРазовых(Команда)
	
	Если Элементы.ВводРазовых.Заголовок = "Ввести разовые начисления." Тогда   // Вводим разовые начисления.
		
		Если Объект.Ссылка.Пустая() ИЛИ НЕ Объект.Проведен Тогда

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Проведите документ!");
			
			Возврат;
			
		ИначеЕсли Объект.Проведен И ЭтаФорма.Модифицированность Тогда

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Документ был изменен, перепроведите документ!");
			
			Возврат;
			
		КонецЕсли;  
		
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидОперацииКорректировкиПоказанийСчетчиков.КорректировкаОшибочныхПоказаний") Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("ВвестиРазовыеНачисленияЗавершение", ЭтотОбъект), "Выполнить перерасчет документа перед операцией?", РежимДиалогаВопрос.ДаНет); 
		Иначе
			ПараметрыФормы = Новый Структура;
			
			МассивНачислений = ПолучитьНачисленияНаСервере();
			
			СписокЛСАдресХран         = ПолучитьСписокКолонокТабличнойЧастиКорректировкаПоказаний();
			
			ПараметрыФормы.Вставить("МассивНачислений", МассивНачислений);
			ПараметрыФормы.Вставить("ВидОперации"     , ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.КорректировкаПоказанийСчетчиков"));
			ПараметрыФормы.Вставить("Дата"            , Объект.Дата);
			
			ПараметрыФормы.Вставить("Ответственный"   , бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
			
			ПараметрыФормы.Вставить("Документ"        , Объект.Ссылка);
			
			ПараметрыФормы.Вставить("СписокЛСАдресХран"        , СписокЛСАдресХран);
			
			ОткрытьФорму("Документ.бит_РазовыеПоУслугамЖКХ.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзДокументаКорректировкаПоказанийСчетчиков", ПараметрыФормы), ЭтаФорма);
			
			УправлениеЭлементамиФормы();
		КонецЕсли; 
		
	Иначе // Открываем разовые начисления.
		
		СтрокаНомера    = Сред(Элементы.ВводРазовых.Заголовок,11,11);
		ДокументРазовые = НайтиПоНомеруДокументРазовыеПоУслугамЖКХНаСервере(СтрокаНомера);
		
		ПоказатьЗначение(Новый ОписаниеОповещения("ВводРазовыхЗавершение", ЭтотОбъект), ДокументРазовые);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиРазовыеНачисленияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
    Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьОшибочныеПоказанияНаСервере();
		НуженПерерасчет = Ложь;
		ЗаписатьНаСервере();
    КонецЕсли;	
	
	МассивНачислений	= ПолучитьНачисленияНаСервере();
	СписокЛСАдресХран	= ПолучитьСписокКолонокТабличнойЧастиКорректировкаПоказаний();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МассивНачислений"	, МассивНачислений);
	ПараметрыФормы.Вставить("ВидОперации"		, ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.КорректировкаПоказанийСчетчиков"));
	ПараметрыФормы.Вставить("Дата"				, Объект.Дата);
	ПараметрыФормы.Вставить("Ответственный"		, бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	ПараметрыФормы.Вставить("Документ"			, Объект.Ссылка);
	ПараметрыФормы.Вставить("СписокЛСАдресХран"	, СписокЛСАдресХран);
	ОткрытьФорму("Документ.бит_РазовыеПоУслугамЖКХ.Форма.ФормаДокументаУправляемая", Новый Структура("ЗаполнитьИзДокументаКорректировкаПоказанийСчетчиков", ПараметрыФормы), ЭтаФорма);
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВводРазовыхЗавершение(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ПолучитьРзовые();
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если мКэшЗначений.Улица <> ВыбранноеЗначение Тогда
		Объект.Здание = ПредопределенноеЗначение("Справочник.бит_СписокЗданий.ПустаяСсылка");
	КонецЕсли;
	Объект.Улица = ВыбранноеЗначение;
	мКэшЗначений.Улица = ВыбранноеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Улица) Тогда
		СтандартнаяОбработка = Ложь;
		Отбор = Новый Структура;
		Отбор.Вставить("Улица", Объект.Улица);
		ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоля

&НаКлиенте
Процедура КорректировкаПоказанийПриАктивизацииСтроки(Элемент)
	
	ТекСтрока = Элементы.КорректировкаПоказаний.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.ДатаНачала) Тогда
			
			ТекСтрока.ДатаНачала = НачалоМесяца(Объект.Дата);
			ТекСтрока.Период     = бит_РаботаСДиалогами.ДатаКакМесяцПредставление(ТекСтрока.ДатаНачала);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Объект.КорректировкаПоказаний.Количество() > 0 Тогда
		
		Если мКэшЗначений.Свойство("ТекущийСчетчик") = Ложь Тогда
			
			мКэшЗначений.Вставить("ТекущийСчетчик",ТекСтрока.Счетчик);
			
		Иначе
			
			мКэшЗначений.ТекущийСчетчик = ТекСтрока.Счетчик;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПоказанийПриИзменении(Элемент)
	
	НуженПерерасчет = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПоказанийПередУдалением(Элемент, Отказ)
	
	ТекСтрока = Элементы.КорректировкаПоказаний.ТекущиеДанные;
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("ЛицевойСчет", ТекСтрока.ЛицевойСчет);
	Отбор.Вставить("Счетчик"    , ТекСтрока.Счетчик);
	
	Если ТекСтрока.Многотарифный Тогда
		
		Отбор.Вставить("Услуга", ТекСтрока.Услуга);
		
	КонецЕсли; 
	
	УдалитьСписокТаблицыУслугНаСервере(Отбор);
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПоказанийПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ТекущиеДанные = Элементы.КорректировкаПоказаний.ТекущиеДанные;
		
		ТекущиеДанные.ИсточникПоказаний = ПредопределенноеЗначение("Перечисление.бит_ИсточникПоказаний.Население");
		ТекущиеДанные.Счетчик           = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПоказанийПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекДанные = Элементы.КорректировкаПоказаний.ТекущиеДанные;
	ТекСтрока = Элементы.КорректировкаПоказаний.ТекущаяСтрока;
	
	Если ТекДанные.КорректировочныеПоказания = 0 Тогда
		
		мМассивСтрок.Добавить(ТекСтрока);  
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПоказанийПериодПриИзменении(Элемент)
	
	ТекСтрока = Элементы.КорректировкаПоказаний.ТекущиеДанные;
	
	ТекСтрока.Период = бит_РаботаСДиалогами.ДатаКакМесяцПредставление(ТекСтрока.ДатаНачала);
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПоказанийПериодНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.КорректировкаПоказаний.ТекущиеДанные;
	
	ПериодРегистрации = бит_РаботаСДиалогами.НачалоВыбораИзСпискаПредставленияПериодаРегистрацииФункция(ТекСтрока.Период, СтандартнаяОбработка, ТекСтрока.ДатаНачала, ЭтаФорма);
	
	ТекСтрока.ДатаНачала = ПериодРегистрации;
	
	ТекСтрока.Период = бит_РаботаСДиалогами.ДатаКакМесяцПредставление(ТекСтрока.ДатаНачала);
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПоказанийПериодОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПоказанийПериодРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.КорректировкаПоказаний.ТекущиеДанные;
	
	ТекСтрока.ДатаНачала = ДобавитьМесяц(ТекСтрока.ДатаНачала, Направление);
	
	ТекСтрока.Период = бит_РаботаСДиалогами.ДатаКакМесяцПредставление(ТекСтрока.ДатаНачала);
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПоказанийЛицевойСчетПриИзменении(Элемент)
	
	ТекСтрока = Элементы.КорректировкаПоказаний.ТекущиеДанные;
	
	ТекСтрока.НачисленияЗаПериод = 0;
	ТекСтрока.НачальныеПоказания = 0;
	ТекСтрока.Счетчик            = Неопределено;
	ТекСтрока.Услуга             = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПоказанийПериодАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	бит_РаботаСДиалогами.ДатаКакМесяцАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПоказанийСчетчикНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.КорректировкаПоказаний.ТекущиеДанные;
	
	СписокСчетчиков = ПолучитьСписокСчетчиков(ТекСтрока.ЛицевойСчет, Объект.Дата);
	
	ВыбранныйЭлемент = Неопределено;
	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("КорректировкаПоказанийСчетчикНачалоВыбораИзСпискаЗавершение", ЭтотОбъект, Новый Структура("ТекСтрока", ТекСтрока)), СписокСчетчиков, Элементы.КорректировкаПоказанийСчетчик);
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПоказанийСчетчикНачалоВыбораИзСпискаЗавершение(ВыбранныйЭлемент1, ДополнительныеПараметры) Экспорт
	
	ТекСтрока = ДополнительныеПараметры.ТекСтрока;
	
	ВыбранныйЭлемент = ВыбранныйЭлемент1;
	
	Если Не ВыбранныйЭлемент = Неопределено Тогда
		
		Если НЕ ВыбранныйЭлемент.Значение = Неопределено Тогда
			
			Если мКэшЗначений.ТекущийСчетчик <> ВыбранныйЭлемент.Значение Тогда
				
				ТекСтрока.НачальныеПоказания = 0;
				ТекСтрока.Услуга             = Неопределено;
				ТекСтрока.ИсточникПоказаний  = ПредопределенноеЗначение("Перечисление.бит_ИсточникПоказаний.Население");
				ТекСтрока.ТипДокумента       = "";
				ТекСтрока.ДатаОтПоказаний    = Неопределено;
				ТекСтрока.НачисленияЗаПериод = 0;
				
			КонецЕсли;
			
			Если НЕ ТекСтрока = Неопределено И НЕ ТекСтрока.Счетчик = ВыбранныйЭлемент.Значение Тогда
				
				Многотарифный = МноготарифныйСчетчик(ТекСтрока.ЛицевойСчет, ВыбранныйЭлемент.Значение, КонецДня(Объект.Дата));
				
				ТекСтрока.Многотарифный = Многотарифный;
				
				Отбор = Новый Структура;
				
				Отбор.Вставить("ЛицевойСчет", ТекСтрока.ЛицевойСчет);
				Отбор.Вставить("Счетчик"    , ТекСтрока.Счетчик);
				
				СтрокиУслуг = Объект.ТаблицаУслуг.НайтиСтроки(Отбор);
				
				Для каждого Строка Из СтрокиУслуг Цикл
					
					Объект.ТаблицаУслуг.Удалить(Строка);
					
				КонецЦикла; 
				
				Если НЕ Многотарифный Тогда
					
					ЗаполнитьТаблицуУслуг(ТекСтрока.ЛицевойСчет, ВыбранныйЭлемент.Значение, КонецДня(Объект.Дата));
					
				КонецЕсли; 				
				
			КонецЕсли;
			
			Если ВыбранныйЭлемент <> Неопределено Тогда
				
				ТекСтрока.Счетчик = ВыбранныйЭлемент.Значение;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПоказанийУслугаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.КорректировкаПоказаний.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СписокУслуг = ПолучитьСписокУслуг(ТекСтрока.ЛицевойСчет, ТекСтрока.Счетчик, КонецДня(Объект.Дата));
		
		ВыбранныйЭлемент = Неопределено;

		ПоказатьВыборИзСписка(Новый ОписаниеОповещения("КорректировкаПоказанийУслугаНачалоВыбораИзСпискаЗавершение", ЭтотОбъект, Новый Структура("ТекСтрока", ТекСтрока)), СписокУслуг, Элементы.КорректировкаПоказанийУслуга);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПоказанийУслугаНачалоВыбораИзСпискаЗавершение(ВыбранныйЭлемент1, ДополнительныеПараметры) Экспорт
    
    ТекСтрока = ДополнительныеПараметры.ТекСтрока;
    
    ВыбранныйЭлемент = ВыбранныйЭлемент1;
    
    Если ВыбранныйЭлемент <> Неопределено Тогда
        
        Если НЕ ВыбранныйЭлемент.Значение = Неопределено Тогда
            
            ТекСтрока.Услуга             = ВыбранныйЭлемент.Значение;				
            ТекСтрока.НачальныеПоказания = 0;
            ТекСтрока.ИсточникПоказаний  = ПредопределенноеЗначение("Перечисление.бит_ИсточникПоказаний.Население");
            ТекСтрока.ТипДокумента       = "";
            ТекСтрока.ДатаОтПоказаний    = Неопределено;
            ТекСтрока.НачисленияЗаПериод = 0;
            
            Отбор = Новый Структура;
            
            Отбор.Вставить("ЛицевойСчет", ТекСтрока.ЛицевойСчет);
            Отбор.Вставить("Услуга"     , ТекСтрока.Услуга);
            
            СтрокиУслуг = Объект.ТаблицаУслуг.НайтиСтроки(Отбор);
            
            Для каждого Строка Из СтрокиУслуг Цикл
                
                Объект.ТаблицаУслуг.Удалить(Строка);
                
            КонецЦикла;
            
            НоваяСтрока = Объект.ТаблицаУслуг.Добавить();
            
            НоваяСтрока.ЛицевойСчет = ТекСтрока.ЛицевойСчет;
            НоваяСтрока.Услуга      = ВыбранныйЭлемент.Значение;
            
            ТекСтрока.ПоследниеПоказания = ПолучитьПоуследниеПоказания(ТекСтрока.ЛицевойСчет, ТекСтрока.Счетчик, ВыбранныйЭлемент.Значение, Объект.Ссылка);
            
        КонецЕсли;
        
    КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Функция выполняет заполненние списка начальных показаний.
//
&НаСервере
Функция ЗаполнитьСписокНачальныхПоказаний(Знач ЛицевойСчет, Знач Счетчик, Знач НачалоПериода, Знач КонецПериода, Знач Услуга, Знач Многотарифный = Ложь, Знач ВидОперации, Знач Ссылка);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Регистратор КАК Регистратор,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
	|	МАКСИМУМ(бит_СчетчикиНаУслугахОбщийСрезПоследних.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_ВсеСчетчики
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
	|			&Дата,
	|			Объект = &Объект
	|				И Счетчик = &Счетчик) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеСчетчики.Объект,
	|	ВТ_ВсеСчетчики.Счетчик,
	|	ВТ_ВсеСчетчики.Период
	|ИЗ
	|	ВТ_ВсеСчетчики КАК ВТ_ВсеСчетчики
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_УстановкаСчетчика КАК бит_УстановкаСчетчика
	|		ПО ВТ_ВсеСчетчики.Регистратор = бит_УстановкаСчетчика.Ссылка
	|ГДЕ
	|	бит_УстановкаСчетчика.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.бит_ВидыОперацийУстановкаСчетчика.ДобавитьУслугиНаСчетчик)";
	
	Запрос.УстановитьПараметр("Дата"   , КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("Счетчик", Счетчик);
	Запрос.УстановитьПараметр("Объект" , ЛицевойСчет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		НачалоПериода = ?(Выборка.Период > НачалоПериода, Выборка.Период, НачалоПериода);
		
	КонецЕсли; 
	
	Условие = "(бит_ПоказанияСчетчиков.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам ИЛИ бит_ПоказанияСчетчиков.Регистратор ССЫЛКА Документ.бит_УстановкаСчетчика)";
	
	Если ВидОперации = Перечисления.бит_ВидОперацииКорректировкиПоказанийСчетчиков.КорректировкаНачальныхПоказаний Тогда
		
		Условие = "бит_ПоказанияСчетчиков.Регистратор ССЫЛКА Документ.бит_УстановкаСчетчика";
		
	КонецЕсли;
	
	УсловиеУслуга = "";
	Если Многотарифный Тогда
		УсловиеУслуга = " И Услуга = &Услуга";
	КонецЕсли; 
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга
	|ПОМЕСТИТЬ СписокУслуг
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&КонецПериода, ЛицевойСчет = &Объект" + УсловиеУслуга + ") КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ПоказанияСчетчиков.Период КАК Период,
	|	бит_ПоказанияСчетчиков.Объект,
	|	бит_ПоказанияСчетчиков.Счетчик,
	|	бит_ПоказанияСчетчиков.ПоследниеПоказания КАК НачальныеПоказания,
	|	ВЫБОР
	|		КОГДА бит_ПоказанияСчетчиков.ТекущиеПоказанияИнспектора <> 0
	|			ТОГДА ""Инспектор""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА бит_ПоказанияСчетчиков.ТекущиеПоказанияНаселения <> 0
	|					ТОГДА ""Население""
	|				ИНАЧЕ ВЫБОР
	|						КОГДА бит_ПоказанияСчетчиков.ПоказанияПодкрутка <> 0
	|							ТОГДА ""Подкрутка""
	|						ИНАЧЕ ""Насиление""
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Метка,
	|	бит_ПоказанияСчетчиков.Регистратор
	|ИЗ
	|	РегистрНакопления.бит_ПоказанияСчетчиков КАК бит_ПоказанияСчетчиков
	|ГДЕ
	|	бит_ПоказанияСчетчиков.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И бит_ПоказанияСчетчиков.Объект = &Объект
	|	И бит_ПоказанияСчетчиков.Счетчик = &Счетчик
	|	И бит_ПоказанияСчетчиков.Регистратор <> &Ссылка
	|	И бит_ПоказанияСчетчиков.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И "+ Условие +"
	|	И бит_ПоказанияСчетчиков.Услуга В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Таб.Услуга
	|			ИЗ
	|				СписокУслуг КАК Таб)
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ПоказанияСчетчиков.Объект,
	|	бит_ПоказанияСчетчиков.Счетчик,
	|	бит_ПоказанияСчетчиков.ПоследниеПоказания,
	|	бит_ПоказанияСчетчиков.Период,
	|	ВЫБОР
	|		КОГДА бит_ПоказанияСчетчиков.ТекущиеПоказанияИнспектора <> 0
	|			ТОГДА ""Инспектор""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА бит_ПоказанияСчетчиков.ТекущиеПоказанияНаселения <> 0
	|					ТОГДА ""Население""
	|				ИНАЧЕ ВЫБОР
	|						КОГДА бит_ПоказанияСчетчиков.ПоказанияПодкрутка <> 0
	|							ТОГДА ""Подкрутка""
	|						ИНАЧЕ ""Насиление""
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	бит_ПоказанияСчетчиков.Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Запрос.УстановитьПараметр("НачалоПериода", ДобавитьМесяц(НачалоМесяца(НачалоПериода), -1));
	Запрос.УстановитьПараметр("КонецПериода" , НачалоМесяца(КонецПериода));
	Запрос.УстановитьПараметр("Ссылка"       , Ссылка);
	Запрос.УстановитьПараметр("Услуга"       , Услуга);
	
	мСоответствие.Очистить();
	
	СписокПоказаний = Новый СписокЗначений;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = мСоответствие.Добавить();
		
		НоваяСтрока.НачальныеПоказания = Выборка.НачальныеПоказания;
		НоваяСтрока.Период             = Выборка.Период;
		НоваяСтрока.ТипДокумента       = ТипЗнч(Выборка.Регистратор);
		
		СписокПоказаний.Добавить(Выборка.НачальныеПоказания, ""+Выборка.Метка+" "+Выборка.НачальныеПоказания +" от:"+ Формат(Выборка.Период, "ДФ=dd.MM.yyyy"));
		
	КонецЦикла;
	
	Возврат СписокПоказаний;
	
КонецФункции

// Функция получает список установленых счетчиков на лицевойм счете.
//
&НаСервереБезКонтекста
Функция ПолучитьСписокСчетчиков(Знач ЛицевойСчет, Знач Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Многотарифный
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(&Дата, Объект = &Объект) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	|ГДЕ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Многотарифный";
	Запрос.УстановитьПараметр("Объект", ЛицевойСчет);
	Запрос.УстановитьПараметр("Дата"  , КонецДня(Дата));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокСчетчиков = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл
		
		СписокСчетчиков.Добавить(Выборка.Счетчик);
		
	КонецЦикла;  
	
	Возврат СписокСчетчиков;
	
КонецФункции

// Функция возвращает начисления в периоде по счетчику.
//
&НаСервере
Функция ПолучитьНачисления(Знач ЛицевойСчет, Знач Счетчик, Знач НачалоПериода, Знач КонецПериода, Знач Услуга, Знач Многотарифный = Ложь)
	
	УсловиеУслуга = "";
	
	Если Многотарифный Тогда
		
		УсловиеУслуга = " И УслугаЖКХ = &Услуга";
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НачисленияПоСчетчикамОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоСчетчикамОбороты.Счетчик,
	|	бит_НачисленияПоСчетчикамОбороты.УслугаЖКХ КАК Услуга,
	|	СУММА(бит_НачисленияПоСчетчикамОбороты.СуммаОборот) КАК Сумма
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоСчетчикам.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И Счетчик = &Счетчик "+УсловиеУслуга+") КАК бит_НачисленияПоСчетчикамОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоСчетчикамОбороты.ЛицевойСчет,
	|	бит_НачисленияПоСчетчикамОбороты.Счетчик,
	|	бит_НачисленияПоСчетчикамОбороты.УслугаЖКХ
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("КонецПериода" , КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("ЛицевойСчет"  , ЛицевойСчет);
	Запрос.УстановитьПараметр("Счетчик"      , Счетчик);
	Запрос.УстановитьПараметр("Услуга"       , Услуга);
	
	Начислено = 0;
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		
		Начислено = Выборка.Сумма;
		
		ВыборкаУС = Выборка.Выбрать();
		
		Пока ВыборкаУС.Следующий() Цикл
			
			Отбор = Новый Структура;
			
			Отбор.Вставить("ЛицевойСчет", ЛицевойСчет);
			Отбор.Вставить("Счетчик"    , Счетчик);
			Отбор.Вставить("Услуга"     , ВыборкаУС.Услуга);
			
			Поиск = Объект.ТаблицаУслуг.НайтиСтроки(Отбор);
			
			Для каждого СтрокаТаблицы Из Поиск Цикл
				
				СтрокаТаблицы.НачисленияЗаПериод = ВыборкаУС.Сумма;
				
			КонецЦикла; 
			
		КонецЦикла; 
		
	КонецЦикла; 
	
	Возврат Начислено;
	
КонецФункции

&НаСервере
Процедура ПолучитьРзовые()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.ВводРазовых.Заголовок = "Ввести разовые начисления.";
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	бит_РазовыеПоУслугамЖКХ.Ссылка КАК ДокументРазовые
	|ИЗ
	|	Документ.бит_РазовыеПоУслугамЖКХ КАК бит_РазовыеПоУслугамЖКХ
	|ГДЕ
	|	бит_РазовыеПоУслугамЖКХ.Документ = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Элементы.ВводРазовых.Заголовок = "Разовые № " + Строка(Выборка.ДокументРазовые.Номер) + " от:" + Строка(Выборка.ДокументРазовые.Дата);
		
	Иначе
		
		Элементы.ВводРазовых.Заголовок = "Ввести разовые начисления.";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНачисленияНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	Начисления = Документы.бит_КорректировкаПоказанийСчетчиков.РасчитатьРазовыеПокорректировке(Объект.Ссылка, Объект.Дата);
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
	МассивНачислений = бит_ОбщегоНазначения.ТаблицаЗначенийВМассив(Начисления);
	
	Возврат МассивНачислений;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокКолонокТабличнойЧастиКорректировкаПоказаний()
	
	СписокЛС = Объект.КорректировкаПоказаний.Выгрузить( , "ЛицевойСчет");
	
	АдресХран = ПоместитьВоВременноеХранилище(СписокЛС,АдресХран);
	
	СписокЛ = ПолучитьИзВременногоХранилища(АдресХран); 
	
	Возврат АдресХран;
	
КонецФункции

&НаСервере
Функция НайтиПоНомеруДокументРазовыеПоУслугамЖКХНаСервере(СтрокаНомера)
	
	ДокументРазовые = Документы.бит_РазовыеПоУслугамЖКХ.НайтиПоНомеру(СтрокаНомера, Объект.Дата);
	
	Возврат ДокументРазовые;
	
КонецФункции

&НаСервереБезКонтекста
Функция МноготарифныйСчетчик(Знач ЛицевойСчет, Знач Счетчик, Знач Дата)
	
	Многотарифный = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("Счетчик"    , Счетчик);
	Запрос.УстановитьПараметр("Дата"       , Дата);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(ЕСТЬNULL(бит_СчетчикиНаУслугахОбщийСрезПоследних.Многотарифный, 0)) КАК Многотарифный
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
	|			&Дата,
	|			Счетчик = &Счетчик
	|				И Объект = &ЛицевойСчет) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	|ГДЕ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Многотарифный = Выборка.Многотарифный;
	КонецЕсли; 
	
	Возврат Многотарифный;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуУслуг(Знач ЛицевойСчет, Знач Счетчик, Знач Дата)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект КАК ЛицевойСчет,
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
	|			&Дата,
	|			Объект = &Объект
	|				И Счетчик = &Счетчик) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата"   , КонецДня(Дата));
	Запрос.УстановитьПараметр("Счетчик", Счетчик);
	Запрос.УстановитьПараметр("Объект" , ЛицевойСчет);
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Объект.ТаблицаУслуг.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		НоваяСтрока.ПоследниеПоказания = ПолучитьПоуследниеПоказания(НоваяСтрока.ЛицевойСчет, НоваяСтрока.Счетчик, НоваяСтрока.Услуга, Объект.Ссылка);
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПоуследниеПоказания(Знач ЛицевойСчет, Знач Счетчик, Знач Услуга, Знач Ссылка)
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("Счетчик"    , Счетчик);
	Запрос.УстановитьПараметр("Услуга"     , Услуга);
	Запрос.УстановитьПараметр("ССЫЛКА"     , ССЫЛКА);
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	бит_ПоказанияСчетчиков.ПоследниеПоказания,
	|	бит_ПоказанияСчетчиков.Период КАК Период,
	|	бит_ПоказанияСчетчиков.Объект,
	|	бит_ПоказанияСчетчиков.Услуга,
	|	бит_ПоказанияСчетчиков.Счетчик
	|ИЗ
	|	РегистрНакопления.бит_ПоказанияСчетчиков КАК бит_ПоказанияСчетчиков
	|ГДЕ
	|	бит_ПоказанияСчетчиков.Объект = &ЛицевойСчет
	|	И бит_ПоказанияСчетчиков.Счетчик = &Счетчик
	|	И бит_ПоказанияСчетчиков.Услуга = &Услуга
	|	И бит_ПоказанияСчетчиков.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И НЕ бит_ПоказанияСчетчиков.Регистратор = &ССЫЛКА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Результат = Выборка.ПоследниеПоказания;
		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоказанияПодкрутки.Период КАК ПериодПодкрутки,
	|	ЕСТЬNULL(ЗакрытыеПоказания.Период, НАЧАЛОПЕРИОДА(ПоказанияПодкрутки.Период, МЕСЯЦ)) КАК ПериодПоказаний,
	|	ЕСТЬNULL(СведенияОсчетчике.Многотарифный, ЛОЖЬ) КАК Многотарифный,
	|	СведенияОсчетчике.Объект КАК Объект,
	|	СведенияОсчетчике.Услуга КАК Услуга,
	|	СведенияОсчетчике.Счетчик КАК Счетчик
	|ИЗ
	|	(ВЫБРАТЬ
	|		бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект КАК Объект,
	|		бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга КАК Услуга,
	|		бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик КАК Счетчик,
	|		бит_СчетчикиНаУслугахОбщийСрезПоследних.Многотарифный КАК Многотарифный
	|	ИЗ
	|		РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(&КонецПериода, ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Индивидуальный)) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	|	ГДЕ
	|		бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать) КАК СведенияОсчетчике
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			бит_ПоказанияСчетчиков.Объект КАК Объект,
	|			бит_ПоказанияСчетчиков.Счетчик КАК Счетчик,
	|			бит_ПоказанияСчетчиков.Услуга КАК Услуга,
	|			МАКСИМУМ(бит_ПоказанияСчетчиков.Период) КАК Период
	|		ИЗ
	|			РегистрНакопления.бит_ПоказанияСчетчиков КАК бит_ПоказанияСчетчиков
	|		ГДЕ
	|			бит_ПоказанияСчетчиков.Счетчик.ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Индивидуальный)
	|			И бит_ПоказанияСчетчиков.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|			И бит_ПоказанияСчетчиков.Объект.УлицаЛицевогоСчета = &УлицаЛицевогоСчета
	|			И бит_ПоказанияСчетчиков.Объект.Здание = &Здание
	|			И бит_ПоказанияСчетчиков.ПоказанияПодкрутка <> 0
	|			И бит_ПоказанияСчетчиков.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			бит_ПоказанияСчетчиков.Счетчик,
	|			бит_ПоказанияСчетчиков.Услуга,
	|			бит_ПоказанияСчетчиков.Объект) КАК ПоказанияПодкрутки
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				бит_ПоказанияСчетчиков.Объект КАК Объект,
	|				бит_ПоказанияСчетчиков.Счетчик КАК Счетчик,
	|				бит_ПоказанияСчетчиков.Услуга КАК Услуга,
	|				МАКСИМУМ(бит_ПоказанияСчетчиков.Период) КАК Период
	|			ИЗ
	|				РегистрНакопления.бит_ПоказанияСчетчиков КАК бит_ПоказанияСчетчиков
	|			ГДЕ
	|				бит_ПоказанияСчетчиков.Счетчик.ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Индивидуальный)
	|				И бит_ПоказанияСчетчиков.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|				И бит_ПоказанияСчетчиков.Объект.УлицаЛицевогоСчета = &УлицаЛицевогоСчета
	|				И бит_ПоказанияСчетчиков.Объект.Здание = &Здание
	|				И (бит_ПоказанияСчетчиков.ТекущиеПоказанияИнспектора <> 0
	|						ИЛИ бит_ПоказанияСчетчиков.ТекущиеПоказанияНаселения <> 0)
	|				И бит_ПоказанияСчетчиков.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			
	|			СГРУППИРОВАТЬ ПО
	|				бит_ПоказанияСчетчиков.Услуга,
	|				бит_ПоказанияСчетчиков.Объект,
	|				бит_ПоказанияСчетчиков.Счетчик) КАК ЗакрытыеПоказания
	|			ПО (ЗакрытыеПоказания.Период <= ПоказанияПодкрутки.Период)
	|				И (ЗакрытыеПоказания.Объект = ПоказанияПодкрутки.Объект)
	|				И (ЗакрытыеПоказания.Счетчик = ПоказанияПодкрутки.Счетчик)
	|				И (ЗакрытыеПоказания.Услуга = ПоказанияПодкрутки.Услуга)
	|		ПО СведенияОсчетчике.Счетчик = ПоказанияПодкрутки.Счетчик
	|			И СведенияОсчетчике.Услуга = ПоказанияПодкрутки.Услуга
	|			И СведенияОсчетчике.Объект = ПоказанияПодкрутки.Объект
	|ИТОГИ
	|	МАКСИМУМ(Многотарифный)
	|ПО
	|	Объект,
	|	Счетчик";
	
	Запрос.УстановитьПараметр("УлицаЛицевогоСчета", Объект.Улица);
	Запрос.УстановитьПараметр("Здание"            , Объект.Здание);
	Запрос.УстановитьПараметр("КонецПериода"      , КонецДня(Объект.Дата));
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		
		ВыборкаСЧ = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСЧ.Следующий() Цикл
			
			НоваяСтрока = Объект.КорректировкаПоказаний.Добавить();
			
			НоваяСтрока.ЛицевойСчет       = ВыборкаСЧ.Объект;
			НоваяСтрока.ИсточникПоказаний = Перечисления.бит_ИсточникПоказаний.Население;
			
			ВыборкаПоЛС = ВыборкаСЧ.Выбрать();
			
			Многотарифный = ВыборкаСЧ.Многотарифный;
			ТекСтрока     = 0;
			
			Пока ВыборкаПоЛС.Следующий() Цикл
				
				Если Многотарифный Тогда
					
					Если ТекСтрока > 0 Тогда
						
						НоваяСтрока = Объект.КорректировкаПоказаний.Добавить();
						
						НоваяСтрока.ЛицевойСчет       = Выборка.Объект;
						НоваяСтрока.ИсточникПоказаний = Перечисления.бит_ИсточникПоказаний.Население;
						
					КонецЕсли; 
					
					НоваяСтрока.Услуга        = ВыборкаПоЛС.Услуга;
					НоваяСтрока.Многотарифный = Истина;
					
				КонецЕсли; 
				
				ЗапросПодкрутка = Новый Запрос;
				
				ЗапросПодкрутка.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	бит_ПоказанияСчетчиков.Период КАК Период,
				|	бит_ПоказанияСчетчиков.Объект,
				|	бит_ПоказанияСчетчиков.Услуга,
				|	бит_ПоказанияСчетчиков.Счетчик КАК Счетчик,
				|	бит_ПоказанияСчетчиков.ПоказанияПодкрутка
				|ИЗ
				|	РегистрНакопления.бит_ПоказанияСчетчиков КАК бит_ПоказанияСчетчиков
				|ГДЕ
				|	бит_ПоказанияСчетчиков.Период МЕЖДУ &НачалоПериода И &КонецПериода
				|	И бит_ПоказанияСчетчиков.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
				|	И бит_ПоказанияСчетчиков.Объект = &Объект
				|	И бит_ПоказанияСчетчиков.Услуга = &Услуга
				|	И бит_ПоказанияСчетчиков.Счетчик = &Счетчик
				|	И бит_ПоказанияСчетчиков.ПоказанияПодкрутка <> 0
				|	И бит_ПоказанияСчетчиков.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
				|
				|УПОРЯДОЧИТЬ ПО
				|	Период";
				ЗапросПодкрутка.УстановитьПараметр("НачалоПериода", ВыборкаПоЛС.ПериодПоказаний);
				ЗапросПодкрутка.УстановитьПараметр("КонецПериода" , ВыборкаПоЛС.ПериодПодкрутки);
				ЗапросПодкрутка.УстановитьПараметр("Объект"       , ВыборкаПоЛС.Объект);
				ЗапросПодкрутка.УстановитьПараметр("Счетчик"      , ВыборкаПоЛС.Счетчик);
				ЗапросПодкрутка.УстановитьПараметр("Услуга"       , ВыборкаПоЛС.Услуга);
				
				ВыборкаПодкрутка = ЗапросПодкрутка.Выполнить().Выбрать();
				
				Пока ВыборкаПодкрутка.Следующий() Цикл
					
					НоваяСтрока.Период             = бит_РаботаСДиалогамиСервер.ДатаКакМесяцПредставление(ВыборкаПодкрутка.Период);
					НоваяСтрока.НачальныеПоказания = ВыборкаПодкрутка.ПоказанияПодкрутка;
					НоваяСтрока.Счетчик            = ВыборкаПодкрутка.Счетчик;
					НоваяСтрока.ДатаОтПоказаний    = ВыборкаПодкрутка.Период;
					НоваяСтрока.ДатаНачала         = ВыборкаПодкрутка.Период;
					
				КонецЦикла;
				
				НоваяСтрокаУС =  Объект.ТаблицаУслуг.Добавить();
				
				НоваяСтрокаУС.ЛицевойСчет = ВыборкаПодкрутка.Объект;
				НоваяСтрокаУС.Услуга      = ВыборкаПодкрутка.Услуга;
				НоваяСтрокаУС.Счетчик     = ВыборкаПодкрутка.Счетчик;
				
				ТекСтрока = ТекСтрока + 1;
				
				НоваяСтрока.НачисленияЗаПериод = ПолучитьНачисления(НоваяСтрока.ЛицевойСчет, НоваяСтрока.Счетчик, ДобавитьМесяц(НоваяСтрока.ДатаОтПоказаний, -1), Объект.Дата, НоваяСтрока.Услуга, НоваяСтрока.Многотарифный);
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	Объект.КорректировкаПоказаний.Сортировать("Период Возр, ЛицевойСчет Возр, Счетчик Возр");
	
КонецПроцедуры

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	КэшированныеЗначения.Вставить("Организация"         , Объект.Организация);
	КэшированныеЗначения.Вставить("Улица"               , Объект.Улица);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокУслуг(Знач ЛицевойСчет, Знач Счетчик, Знач Дата)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Услуга
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
	|			&Дата,
	|			Объект = &Объект
	|				И Счетчик = &Счетчик) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	|ГДЕ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать";
	
	Запрос.УстановитьПараметр("Объект" , ЛицевойСчет);
	Запрос.УстановитьПараметр("Счетчик", Счетчик);
	Запрос.УстановитьПараметр("Дата"   , Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокУслуг = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл
		
		СписокУслуг.Добавить(Выборка.Услуга);
		
	КонецЦикла;  
	
	Возврат СписокУслуг;
	
КонецФункции

&НаСервере
Процедура УдалитьСписокТаблицыУслугНаСервере(Отбор)
	
	СтрокиУслуг = Объект.ТаблицаУслуг.НайтиСтроки(Отбор);
	
	Для каждого Строка Из СтрокиУслуг Цикл
		
		Объект.ТаблицаУслуг.Удалить(Строка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьПустыеСтроки()
	
	КоличествоЗаписей = Объект.КорректировкаПоказаний.Количество();
	
	Для Ном = 1 По КоличествоЗаписей  Цикл
		
		Индекс = КоличествоЗаписей - Ном;
		
		ТекСтрока = Объект.КорректировкаПоказаний[Индекс];
		
		Если ТекСтрока.КорректировочныеПоказания = 0 И мМассивСтрок.НайтиПоЗначению(Индекс) = Неопределено Тогда
			
			Объект.КорректировкаПоказаний.Удалить(ТекСтрока);
			
		КонецЕсли;
		
	КонецЦикла;		
	
КонецПроцедуры

&НаСервере
Функция ПроверитьПустыеСтроки()
	
	КоличествоЗаписей = Объект.КорректировкаПоказаний.Количество();
	
	ЕстьПустыеСтроки = Ложь;
	
	Для Ном = 1 По КоличествоЗаписей  Цикл
		
		Индекс = КоличествоЗаписей - Ном;
		
		ТекСтрока = Объект.КорректировкаПоказаний[Индекс];
		
		Если ТекСтрока.КорректировочныеПоказания = 0 И мМассивСтрок.НайтиПоЗначению(Индекс) = Неопределено Тогда
			
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Есть строки с пустыми значениями корректировочных показаний.");
			ЕстьПустыеСтроки = Истина;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;		
	
	Возврат ЕстьПустыеСтроки;
	
КонецФункции

&НаКлиенте
Процедура КорректировкаПоказанийСчетчикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = Элементы.КорректировкаПоказаний.ТекущиеДанные;
	
	СписокСчетчиков = ПолучитьСписокСчетчиков(ТекСтрока.ЛицевойСчет, Объект.Дата);
	
	ВыбранныйЭлемент = Неопределено;
	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("КорректировкаПоказанийСчетчикНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("ТекСтрока", ТекСтрока)), СписокСчетчиков, Элементы.КорректировкаПоказанийСчетчик);
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПоказанийСчетчикНачалоВыбораЗавершение(ВыбранныйЭлемент1, ДополнительныеПараметры) Экспорт
	
	ТекСтрока = ДополнительныеПараметры.ТекСтрока;
	
	
	ВыбранныйЭлемент = ВыбранныйЭлемент1;
	
	ОчиститьСообщения();
	
	Если Не ВыбранныйЭлемент = Неопределено Тогда
		
		Если НЕ ВыбранныйЭлемент.Значение = Неопределено Тогда
			
			Если мКэшЗначений.ТекущийСчетчик <> ВыбранныйЭлемент.Значение Тогда
				
				ТекСтрока.НачальныеПоказания = 0;
				ТекСтрока.Услуга             = Неопределено;
				ТекСтрока.ИсточникПоказаний  = ПредопределенноеЗначение("Перечисление.бит_ИсточникПоказаний.Население");
				ТекСтрока.ТипДокумента       = "";
				ТекСтрока.ДатаОтПоказаний    = Неопределено;
				ТекСтрока.НачисленияЗаПериод = 0;
				
			КонецЕсли;
			
			Если НЕ ТекСтрока = Неопределено И НЕ ТекСтрока.Счетчик = ВыбранныйЭлемент.Значение Тогда
				
				Многотарифный = МноготарифныйСчетчик(ТекСтрока.ЛицевойСчет, ВыбранныйЭлемент.Значение, КонецДня(Объект.Дата));
				
				ТекСтрока.Многотарифный = Многотарифный;
				
				Отбор = Новый Структура;
				
				Отбор.Вставить("ЛицевойСчет", ТекСтрока.ЛицевойСчет);
				Отбор.Вставить("Счетчик"    , ТекСтрока.Счетчик);
				
				СтрокиУслуг = Объект.ТаблицаУслуг.НайтиСтроки(Отбор);
				
				Для каждого Строка Из СтрокиУслуг Цикл
					
					Объект.ТаблицаУслуг.Удалить(Строка);
					
				КонецЦикла; 
				
				Если НЕ Многотарифный Тогда
					
					ЗаполнитьТаблицуУслуг(ТекСтрока.ЛицевойСчет, ВыбранныйЭлемент.Значение, КонецДня(Объект.Дата));
					
				КонецЕсли; 				
				
			КонецЕсли;
			
			Если ВыбранныйЭлемент <> Неопределено Тогда
				
				ТекСтрока.Счетчик = ВыбранныйЭлемент.Значение;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПоказанийНачальныеПоказанияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = Элементы.КорректировкаПоказаний.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда
		
		Если ТекСтрока.Многотарифный И НЕ ЗначениеЗаполнено(ТекСтрока.Услуга) Тогда

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Укажите услугу.");
			
			СтандартнаяОбработка = Ложь;
			
			Возврат;
			
		КонецЕсли; 
		
		СписокВыбораНачальныеПоказания = ЗаполнитьСписокНачальныхПоказаний(ТекСтрока.ЛицевойСчет,
		ТекСтрока.Счетчик,
		ТекСтрока.ДатаНачала,
		Объект.Дата,
		ТекСтрока.Услуга,
		ТекСтрока.Многотарифный,
		Объект.ВидОперации,
		Объект.Ссылка);
		
		ВыбранныйЭлемент = Неопределено;
		
		ПоказатьВыборИзСписка(Новый ОписаниеОповещения("КорректировкаПоказанийНачальныеПоказанияНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("ТекСтрока", ТекСтрока)), СписокВыбораНачальныеПоказания, Элементы.КорректировкаПоказанийНачальныеПоказания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПоказанийНачальныеПоказанияНачалоВыбораЗавершение(ВыбранныйЭлемент1, ДополнительныеПараметры) Экспорт
	
	ТекСтрока = ДополнительныеПараметры.ТекСтрока;
	
	
	ВыбранныйЭлемент = ВыбранныйЭлемент1;
	
	ОчиститьСообщения();
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		
		Если ВыбранныйЭлемент.Значение <> Неопределено Тогда
			
			Если ТекСтрока <> Неопределено Тогда
				
				Отбор = Новый Структура;
				
				Отбор.Вставить("НачальныеПоказания", ВыбранныйЭлемент.Значение);
				
				ЗначенияНачислений = мСоответствие.НайтиСтроки(Отбор);
				
				Если ЗначенияНачислений.Количество() > 0 Тогда
					
					ТекСтрока.НачальныеПоказания = ЗначенияНачислений[0].НачальныеПоказания;
					ТекСтрока.ДатаОтПоказаний    = ЗначенияНачислений[0].Период;
					ТекСтрока.ТипДокумента       = ЗначенияНачислений[0].ТипДокумента;
					
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ТекСтрока = Неопределено И НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидОперацииКорректировкиПоказанийСчетчиков.КорректировкаНачальныхПоказаний") Тогда
		
		КолМесяцев = ?(ТекСтрока.ТипДокумента = Строка(Тип("ДокументСсылка.бит_УстановкаСчетчика")),0,1);
		
		ТекСтрока.НачисленияЗаПериод = ПолучитьНачисления(ТекСтрока.ЛицевойСчет, ТекСтрока.Счетчик, ДобавитьМесяц(ТекСтрока.ДатаОтПоказаний, КолМесяцев), Объект.Дата, ТекСтрока.Услуга, ТекСтрока.Многотарифный);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПоказанийПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = Элементы.КорректировкаПоказаний.ТекущиеДанные;
	
	ПараметрыОтбора = Новый Структура("НачалоПериода, КонецПериода", НачалоМесяца(ТекСтрока.ДатаНачала), КонецМесяца(ТекСтрока.ДатаНачала));
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериодаМесяц", ПараметрыОтбора, ТекСтрока.Период, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПериода()
	
	ТекСтрока = Элементы.КорректировкаПоказаний.ТекущиеДанные;
	
	// Обновляем представление периода на форме.
	ТекСтрока.Период = бит_РаботаСДиалогами.ДатаКакМесяцПредставление(ТекСтрока.ДатаНачала);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтрока = Элементы.КорректировкаПоказаний.ТекущиеДанные;
	
	ТекСтрока.ДатаНачала = РезультатВыбора.КонецПериода;
	
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПоказанийУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = Элементы.КорректировкаПоказаний.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда
		
		СписокУслуг = ПолучитьСписокУслуг(ТекСтрока.ЛицевойСчет, ТекСтрока.Счетчик, КонецДня(Объект.Дата));
		
		ВыбранныйЭлемент = Неопределено;

		ПоказатьВыборИзСписка(Новый ОписаниеОповещения("КорректировкаПоказанийУслугаНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("ТекСтрока", ТекСтрока)), СписокУслуг, Элементы.КорректировкаПоказанийУслуга);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПоказанийУслугаНачалоВыбораЗавершение(ВыбранныйЭлемент1, ДополнительныеПараметры) Экспорт
    
    ТекСтрока = ДополнительныеПараметры.ТекСтрока;
    
    ВыбранныйЭлемент = ВыбранныйЭлемент1;
    
    ОчиститьСообщения();
    
    Если ВыбранныйЭлемент <> Неопределено Тогда
        
        Если НЕ ВыбранныйЭлемент.Значение = Неопределено Тогда
            
            ТекСтрока.Услуга             = ВыбранныйЭлемент.Значение;
            
            ТекСтрока.НачальныеПоказания = 0;
            ТекСтрока.ИсточникПоказаний  = ПредопределенноеЗначение("Перечисление.бит_ИсточникПоказаний.Население");
            ТекСтрока.ТипДокумента       = "";
            ТекСтрока.ДатаОтПоказаний    = Неопределено;
            ТекСтрока.НачисленияЗаПериод = 0;
            
            Отбор = Новый Структура;
            
            Отбор.Вставить("ЛицевойСчет", ТекСтрока.ЛицевойСчет);
            Отбор.Вставить("Услуга"     , ТекСтрока.Услуга);
            
            СтрокиУслуг = Объект.ТаблицаУслуг.НайтиСтроки(Отбор);
            
            Для каждого Строка Из СтрокиУслуг Цикл
                
                Объект.ТаблицаУслуг.Удалить(Строка);
                
            КонецЦикла;
            
            НоваяСтрока = Объект.ТаблицаУслуг.Добавить();
            
            НоваяСтрока.ЛицевойСчет = ТекСтрока.ЛицевойСчет;
            НоваяСтрока.Услуга      = ВыбранныйЭлемент.Значение;
            
            ТекСтрока.ПоследниеПоказания = ПолучитьПоуследниеПоказания(ТекСтрока.ЛицевойСчет, ТекСтрока.Счетчик, ВыбранныйЭлемент.Значение, Объект.Ссылка);
            
        КонецЕсли;
        
    КонецЕсли;
    
    Элементы.КорректировкаПоказаний.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ПолучитьРзовые();
	УправлениеЭлементамиФормы();	
	
КонецПроцедуры

#КонецОбласти
